print("=== Конвертер значений ===")

while True:
    ans = int(input("1. Километры в Мили\n2. Милы в Километры\n3.Градусы Цельсия в градусы Фаренгейта\n4.Градусы Фаренгейта в градусы Цельсия\n0.Выход\nВыберите вариант: "))
    if ans not in [0,1,2,3,4]:
        print("Неправильный ввод")
        print("----------")
    elif ans == 0:
        print("До свидания!")
        break
    elif ans == 1:
        a = float(input("Введите значение: "))
        print(f"Итог перевода: {round(a * 0.621371, 2)} миль")
        print("----------")
    elif ans == 2:
        a = float(input("Введите значение: "))
        print(f"Итог перевода: {round(a / 0.621371, 2)} км")
        print("----------")
    elif ans == 3:
        a = float(input("Введите значение: "))
        print(f"Итог перевода: {round((a* 9/5) +32, 2)} Фаренгейт")
        print("----------")
    elif ans == 4:
        a = float(input("Введите значение: "))
        print(f"Итог перевода: {round((a-32) * 5/9, 2)} Цельсия")
        print("----------")
